Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: For historical reasons, the leading C<m> in C<m?PATTERN?> is optional, but the resulting C<?PATTERN?> syntax is deprecated, will warn on usage and might be removed from a future stable release of Perl (without further notice!).
es_es: Por razones históricas, la C<m> precedente en C<m?PATRÓN?> es opcional, pero la sintaxis resultante C<?PATRÓN?> es obsoleta, generando una advertencia sobre su uso y que puede ser eliminada de una próxima versión estable de Perl (¡sin previo aviso!).

source: will match C<blah> in any case, some spaces, and an exact (I<including the case>!) repetition of the previous word, assuming the C</x> modifier, and no C</i> modifier outside this group.
es_es: coincidirá con C<bla> en cualquier tamaño de caja, algunos espacios, y una exacta (I<¡incluyendo el tamaño de caja!>) repetición de la palabra anterior, asumiendo el modificador C</x>, y no el modificador C</i> alrededor de este grupo.

source: Another good indicator that you should use defaults is if most of your users call your routines with the same arguments.
es_es: Otro buen indicador de que debe usar valores por defecto es si la mayor parte de los usuarios llama a sus rutinas con los mismos argumentos.

source: The C application assumes that I<all> keys and values are NULL terminated.
es_es: La aplicación en C supone que I<todas> las claves y sus valores correspondientes terminan con un carácter NULL.

source: MASK defaults to 0777 if omitted, and FILENAME defaults to C<$_> if omitted.
es_es: MÁSCARA está puesto por defecto a 0777, si no se indica, y ARCHIVO es por defecto C<$_>, si no se indica, también.

source: This is somewhat equivalent to the C-style switch statement's fallthrough functionality (not to be confused with I<Perl's> fallthrough functionality - see below), wherein the same block is used for several C<case> statements.
es_es: Esto es algo equivalente a la funcionalidad de la instrucción C<switch> del C (no debe confundirse con la funcionalidad de I<Perl>; vea más adelante), en donde el mismo bloque se utiliza para varias instrucciones C<case>.

source: $quota,$comment,$gcos,$dir,$shell,$expire) = getpw*
es_es: $cuota,$comentario,$gcos,$dir,$shell,$expiracion) = getpw*

source: Now system utilities that read the legacy process name such as ps, top and killall will recognize the name you set when assigning to C<$0>.
es_es: Ahora las utilidades del sistema que lean el nombre del proceso, tales como ps, top y killall reconocerán el nombre asignado a C<$0>.

source: # open for append, using the fileno of OLDFH
es_es: # Abrir para añadir, usando el número de descriptor de OLDFH

source: The importation can be made conditional; see L<if>.
es_es: La importación puede estar condicionado; vea L<if>.

# print "$2 follows $1. ";
source: print "$2 follows $1.\n";
es_es: print "$2 sigue a $1.\n";

source: Note that both "<<" and ">>" in Perl are implemented directly using "<<" and ">>" in C. If C<use integer> (see L<Integer Arithmetic>) is in force then signed C integers are used, else unsigned C integers are used.
es_es: Tenga en cuenta que tanto "<<" como ">>" en Perl están implementados directamente a través de "<<" y ">>" en C. Si C<use integer> (vea L<Aritmética entera>) está en vigor entonces se utilizan los enteros C con signo; sino, se utilizan enteros C sin signo.

source: See L<perlop/"Regexp Quote-Like Operators">.
es_es: See L<perlop/"Operadores Regexp">.

source: The return value is the exit status of the program as returned by the C<wait> call.
es_es: El valor devuelto es el estado de salida del programa devuelto por la llamada C<wait>.

source: The purpose, scope and target applications of your module
es_es: El propósito, ámbito y las aplicaciones objetivo de su módulo

source: If the LABEL is omitted, the loop control statement refers to the innermost enclosing loop.
es_es: Si la ETIQUETA se omite, las instrucciones de control de bucle se refieren al bucle más interior en que se encuentren.

source: File::Spec upgraded to version 3.01 (as part of the new PathTools distribution)
es_es: File::Spec actualizado a la versión 3.01 (como parte de la nueva distribución PathTools)

source: Some examples:
es_es: Algunos ejemplos:

# if ( /$pat/ ) { print "<$1> <$2> ";
source: if ( /$pat/ ) { print "<$1> <$2>\n";
es_es: if ( /$patron/ ) { print "<$1> <$2>\n";

source: will use smart matching (only the first operand is considered), whereas
es_es: usará coincidencia inteligente (sólo el primer operando es considerado), mientras que

source: But you cannot do so for the very first one if it's a scalar containing a reference, which means that $ref_to_AoA always needs it.
es_es: Pero no puede hacerlo para el primer caso si es un escalar que contenga una referencia, lo que significa que $ref_to_AoA siempre lo necesita.

source: For this grouping operator there is no need to describe the ordering, since only whether or not C<S> can match is important.
es_es: Para este operador de agrupación no hay necesidad de describir el orden, ya que sólo es importante si C<S> puede coincidir.

source: Perl resolves this ambiguity by interpreting C<\10> as a backreference only if at least 10 left parentheses have opened before it.
es_es: Perl resuelve esta ambigüedad mediante la interpretación de C<\10> como una contrareferencia cuando, al menos, se han abierto, antes, 10 paréntesis de apertura.

source: A zero-width positive look-behind assertion.
es_es: Una aserción antecedente positiva de ancho cero.

source: my @transformed = map { ...; } @input; # ; disambiguates
es_es: my @transformado = map { ...; } @entrada; # ; desambigüedad

source: # @fields is (1, 'A', 2, undef, 3)
es_es: # @campos es (1, 'A', 2, undef, 3)

source: The whatever is a syntax error if Perl doesn't guess that the C<{ ... }> is a block.
es_es: El lo-que-sea es un error de sintaxis si Perl no supone que C<{ ... }> sea un bloque.

source: If in doubt about this behavior, the left operand can be quoted explicitly.
es_es: En caso de duda acerca de este comportamiento, el operando de la izquierda puede ser entrecomillado de forma explícita.

source: By default all sockets operate on bytes, but for example if the socket has been changed using binmode() to operate with the C<:encoding(utf8)> I/O layer (see L</open>, or the C<open> pragma, L<open>), the I/O will operate on UTF-8 encoded Unicode characters, not bytes.
es_es: Por defecto todos los sockets operan en bytes, pero por ejemplo, si el socket ha sido cambiado usando binmode() para operar con la capa de E/S C<:encoding(utf8)> (ver el pragma C<open>, L<open>), la E/S operará en caracteres codificados en UTF-8, no bytes.

source: Perl has been ported to IBM's OS/400 PASE environment.
es_es: Perl ha sido adaptada al entorno de IBM OS/400 PASE.

source: Under NFS this will use the time of the NFS server, not the time of the local machine.
es_es: Bajo NFS se utilizará la hora del servidor NFS, no el tiempo de la máquina local.

source: If this bothers you, then your notion of Authorship needs some revision.
es_es: Si esto te molesta, entonces el concepto de Autoría necesita un poco de revisión.

source: =item sub NAME (PROTO) : ATTRS BLOCK
es_es: =item sub NOMBRE (PROTO) : ATRIBS BLOQUE

source: The work started in 2002 and is still ongoing.
es_es: El trabajo se inició en 2002 y sigue en curso.

source: This must be a power of two from 1 to 32 (or 64, if your platform supports that).
es_es: Esto debe ser una potencia de dos desde 1 a 32 (o 64, si la plataforma lo admite).

source: X<namespace>
es_es: X<namespace> X<espacio de nombres>

source: Processing of C<\N{...}> is also done here, and compiled into an intermediate form for the regex compiler.
es_es: El procesamiento de C<\N{...}> también se hace aquí, y compilado en una forma intermedia para el compilador de expresiones regulares (RE).

source: q, L, or ll interpret integer as C type "long long", "unsigned long long", or "quad" (typically 64-bit integers)
es_es: q, L, or ll interpreta un entero como un "long long", "unsigned long long", o "quad" del C (típicamente enteros de 64-bit)

source: If umask(2) is not implemented and you are not trying to restrict access for yourself, returns C<undef>.
es_es: Si umask(2) no está implementado y usted no está tratando de restringir el acceso por sí mismo, devuelve C<undef>.

source: =head2 Auto-increment and Auto-decrement X<increment> X<auto-increment> X<++> X<decrement> X<auto-decrement> X<-->
es_es: =head2 Auto incremento y auto decremento X<increment> X<auto-increment> X<++> X<decrement> X<auto-decrement> X<--> X<incremento> X<auto incremento> X<decremento> X<auto decremento>

source: In general though, we try to limit this list to books published in the past five years.
es_es: Sin embargo, en general intentaremos limitar esta lista a libros publicados en los últimos cinco años.

source: The pattern match succeeds and C<$1> is defined, although it matched "nothing".
es_es: El patrón de búsqueda tiene éxito y C<$1> está definida, aunque no ha correspondido con "nada".

source: my $quoted_substring = quotemeta($substring);
es_es: my $subcadena_escapada = quotemeta($subcadena);

source: There are pros and cons of each technique, which should be considered when you design your API.
es_es: Hay pros y contras de cada técnica, lo que debería tenerse en cuenta al diseñar su API.

source: Each major version has significant differences that earlier versions cannot support.
es_es: Cada versión principal incorpora diferencias importantes que no son compatibles con las versiones anteriores.

source: This is the first step at which the presence of the C<//x> modifier is relevant.
es_es: Este es el primer caso en el que la presencia del modificador C<//x> es relevante.

source: #or
es_es: # o

source: perl58delta Perl changes in version 5.8.0
es_es: perl58delta Cambios en la versión 5.8.0

source: When the system design is itself object-oriented
es_es: Cuando el diseño del sistema es en sí orientado a objetos

source: Documentation update
es_es: Actualización de la documentación

source: $ Match the end of the line (or before newline at the end)
es_es: $ Coincide con el final de línea (o antes del nuevo línea del final)

source: The C<< > >> and C<< < >> modifiers can also be used on C<()> groups to force a particular byte-order on all components in that group, including all its subgroups.
es_es: Los modificadores C<< > >> y C<< < >> también se pueden utilizar en los grupos C<()> para obligar a un particular orden de bytes en todos los componentes de ese grupo, que incluye todos sus subgrupos.

source: If that fails, or you didn't use that, then try adjusting other optimization options (-LNO, -INLINE, -O3 to -O2, etcetera).
es_es: Si eso no funciona, o no lo ha usado, intente, a continuación, ajustar otras opciones de optimización (-LNO,-inline, O3-a-O2, etc).

source: =head2 Documentation
es_es: =head2 Documentación

source: If single quotes are used, no interpretation is done on the replacement string (the C</e> modifier overrides this, however).
es_es: Si se utilizan comillas simples, no se realiza ninguna interpretación en la cadena de reemplazo (sin embargo, el modificador C</e> reemplaza a ésta).

source: or die "can't fcntl F_GETFL: $!";
es_es: or die "no puedo hacer fcntl F_GETFL: $!";

source: =head1 GETTING HELP
es_es: =head1 CÓMO OBTENER AYUDA

source: =head2 Terms and List Operators (Leftward) X<list operator> X<operator, list> X<term>
es_es: =head2 Términos y Operadores de listas (por la izquierda) X<list operator> X<operator, list> X<term> X<operador lista> X<operador, lista> X<término>

source: Line up corresponding items vertically.
es_es: Alinear elementos correspondientes verticalmente.

source: sub byage {
es_es: sub por_edad {

source: printf "<%2s>", "long"; # prints "<long>" (does not truncate)
es_es: printf "<%2s>", "long"; # imprie "<long>" (no lo trunca)

source: Decode everything you receive, encode everything you send out.
es_es: Descodifique todo lo que reciba y codifique todo lo que envíe

source: ge greater than or equal
es_es: ge mayor o igual que

source: Likewise, the C<b> and C<B> formats pack a string that's that many bits long.
es_es: Del mismo modo, los formatos C<b> y C<B> empaquetan una cadena con una dada longitud de bits.

source: =item C<< \k<NAME> >>
es_es: =item C<< \k<NOMBRE> >>

source: That algorithm was not stable, so I<could> go quadratic.
es_es: Este algoritmo no era estable, y I<podría> ser cuadrático.

source: This is used by C<AUTOLOAD()> subroutines that wish to load another subroutine and then pretend that the other subroutine had been called in the first place (except that any modifications to C<@_> in the current subroutine are propagated to the other subroutine.) After the C<goto>, not even C<caller()> will be able to tell that this routine was called first.
es_es: Esto se usa por subrutinas C<AUTOLOAD()> que desean cargar otra subrutina y fingen que esta otra subrutina ha sido llamada en primer lugar (excepto que cualquier modificación a C<@_> en la subrutina actual se propaga a la otra). Después del C<goto>, ni siquiera C<caller()> será capaz de decir qué rutina fue llamada en primer lugar.

source: A C<my> declares the listed variables to be local (lexically) to the enclosing block, file, or C<eval>.
es_es: Un C<my> declara las variables enumeradas como locales (léxicamente) en el bloque, archivo, o C<eval>.

source: This means that Perl no longer handles signals immediately but instead "between opcodes", when it is safe to do so.
es_es: Esto significa que Perl ya no gestiona las señales de forma inmediata, sino que "entre los códigos de operación", cuando es más seguro hacerlo.

source: There have been many fixes in the area of anonymous subs, lexicals and closures.
es_es: Ha habido muchas correcciones en el área de las subs anónimas, léxicas y clausuras.

source: Please see L<perltie/SCALAR> for the full details and caveats.
es_es: Por favor, vea L<perltie/SCALAR> para ver todos los detalles y advertencias.

source: C<virtual_port> now works properly with the https protocol
es_es: C<virtual_port> ahora funciona correctamente con el protocolo https

source: It's the equivalent of "!" except for the very low precedence.
es_es: Es el equivalente de "!" excepto por tener una precedencia muy baja.

source: my($filename, $input) = @_;
es_es: my($archivo, $entrada) = @_;

source: Some modules might have special reporting requirements, such as a Sourceforge or Google Code tracking system, so you should check the module documentation too.
es_es: Es posible que algunos módulos tengan requisitos de notificación específicos, como usar un sistema de seguimiento de errores de Sourceforge o Google Code, por lo que es recomendable consultar también la documentación de los módulos.

source: See L<File::Glob> for details, including C<bsd_glob> which does not treat whitespace as a pattern separator.
es_es: Ver L<File::Glob> para los detalles, incluyendo C<bsd_glob> que no trata al espacio en blanco como separador de patrones.

source: =head2 B:: modules inheritance changed
es_es: =head2 Cambiada la herencia en los módulos B::

# } else { print "FAIL ";
source: } else { print "FAIL\n";
es_es: } else { print "FALLO\n";

source: C</ab/> means match "a" AND (then) match "b", although the attempted matches are made at different positions because "a" is not a zero-width assertion, but a one-width assertion.
es_es: C</ab/> significa coincidir con "a" Y (entonces) coincidir con "b", aunque el intento de las coincidencias se realicen en diferentes posiciones, porque "a" no es una aserción de ancho cero, sino una aserción de ancho uno.

source: The C<umask> value is such a number representing disabled permissions bits.
es_es: El valor de C<umask> es un número que representa los bits de lso permisos que quedan desactivados.

source: Here are the quote-like operators that apply to pattern matching and related activities.
es_es: Aquí están los operadores, parecidos a los de entrecomillado, que se aplican a las actividades relacionadas con la coincidencia.

source: $rec = { witch => 'Mable the Merciless', cat => 'Fluffy the Ferocious', date => '10/31/1776',
es_es: $rec = { bruja => 'Mable la Implacable', gato => 'Fluffy el Feroz', fecha => '10/31/1776',

source: %g a floating-point number, in %e or %f notation
es_es: %g un número en punto flotante, en notación %e o %f

source: Thus zero-length matches alternate with one-character-long matches.
es_es: Así, las coincidencias de longitud cero se alternan con una coincidencia de un carácter de longitud.

source: In 2006, I<TPJ> merged with Dr. Dobbs Journal (online edition).
es_es: En 2006, I<TPJ> se fusionó con Dr. Dobbs Journal (edición en línea).

source: Portability of Perl on various recent compilers on Windows has been improved (Borland C++, Visual C++ 7.0).
es_es: La portabilidad de Perl en distintos compiladores recientes de Windows ha sido mejorada (Borland C++, Visual C++ 7.0).

source: make other distribution arrangements with the Copyright Holder.
es_es: hacer otros acuerdos de distribución con el Titular del Copyright.

source: To return all but the last character, use C<substr($string, 0, -1)>.
es_es: Para devolver todos menos el último carácter, use C<substr($string, 0, -1)>.

source: The following equivalences apply:
es_es: Se aplica la siguiente equivalencia:

source: (This is only fancy fancy: if you use the return value of C<-f $file> as an argument to another filetest operator, no special magic will happen.)
es_es: (Esto solo es fascinantemente elegante: si usa el valor devuelto de C<-f $archivo> como un argumento para otro operador de test de archivo, no ocurrirá ninguna magia especial)

source: You can now use recursive subroutines with sort(), thanks to Robin Houston.
es_es: Ahora puede utilizar subrutinas recursivas con sort(), gracias a Robin Houston.

source: C<basename> now returns C</> for parameter C</>, to make C<basename> consistent with the shell utility of the same name.
es_es: C<basename> ahora devuelve C</> para el parámetro C</>, para hacer C<basename> consistente con la utilidad shell del mismo nombre.

source: (If SCALAR has no string value but does have a numeric value, that value will be passed rather than a pointer to the string value.
es_es: (Si ESCALAR no tiene un valor string sino que tiene un valor numérico, este valor será el que se pase, en lugar de un puntero al valor del string.

source: This may not be the same as the compilation-time locale, and can differ from one match to another if there is an intervening call of the L<setlocale() function|perllocale/The setlocale function>.
es_es: Ésta puede no ser la misma que la configuración regional en tiempo de compilación, y pueden diferir de una coincidencia a otra, si hay una llamada a la función L<setlocale() perllocale/La función setlocale>.

source: perliol C API for Perl's implementation of IO in Layers
es_es: perliol API en C para implementar en Perl las capas de E/S

source: If not, raises an exception.
es_es: Si no, lanza una excepción.

source: Math::Cephes::Fraction fractions via the Cephes library
es_es: Math::Cephes::Fraction fracciones vía la biblioteca Cephes

source: # A "reverse comma operator".
es_es: # Un "operador coma inverso".

source: =head2 What machines support perl?
es_es: =head2 ¿Qué equipos son compatibles con perl?

source: Oh, you weren't talking ASCII?
es_es: ¡Ah, no se refería a ASCII!

source: Your module may be object oriented (OO) or not, or it may have both kinds of interfaces available.
es_es: Su módulo puede estar orientado a objetos (POO) o no, o puede tener ambos tipos de interfaces disponibles.

source: warn "has nondigits" if /\D/;
es_es: warn "no dígitos" if /\D/;

source: if (EXPR) BLOCK
es_es: if (EXPR) BLOQUE

source: ISBN: 978-0-596-00173-5 [1st edition July 2005]
es_es: ISBN: 978-0-596-00173-5 [1ª edición - Julio de 2005]

source: hashref ${$$foo[1]}[2] aka $foo->[1][2]
es_es: anónimo ${$$foo[1]}[2] equivale a $foo->[1][2]

source: qw{} Word list no
es_es: qw{} Lista palabras no

source: Improved behaviour on Symbian OS.
es_es: Mejorado el comportamiento en el SO Symbian.

source: If F<sys/ioctl.ph> doesn't exist or doesn't have the correct definitions you'll have to roll your own, based on your C header files such as F<< <sys/ioctl.h> >>.
es_es: Si F<sys/ioctl.ph> no existe o no tiene las definiciones correctas, tendrá que incorporar las suyas propias, basadas en sus archivos de cabecera C como las de F<< <sys/ioctl.h> >>.

source: If not, crypt() dies with C<Wide character in crypt>.
es_es: Si no, crypt() muere con C<Wide character in crypt>.

source: =head2 Platform Specific Changes
es_es: =head2 Cambios específicos de cada plataforma

source: This poses a problem for content such as book lists.
es_es: Esto supone un problema para mantener una lista de libros actualizada.

source: Arguments are forced into the integer format if not strings.
es_es: Fuerzan la conversión de los argumentos al formato de entero si no son cadenas.

source: You also cannot exit out of the sort block or subroutine using any of the loop control operators described in L<perlsyn> or with C<goto>.
es_es: También no puede salir fuera del bloque de ordenación o de la subrutina utilizando cualquiera de los operadores de control de bucle descritos en L<perlsyn> o con C<goto>.

source: Consider offering a choice of levels for warning and debug messages, an option to send messages to a separate file, a way to specify an error-handling routine, or other such features.
es_es: Considere la posibilidad de ofrecer una selección de niveles de alerta y mensajes de depuración, una opción para enviar mensajes a un archivo separado, una forma de especificar una rutina de control de errores, o de otras características.

source: my $sentence = 'The quick brown fox jumped over the lazy dog';
es_es: my $instruccion = 'El rápido zorro marrón saltó sobre el perezoso perro';

source: } while $kid > 0;
es_es: } while $hijo > 0;

source: @colors{'red','blue','green'} = (0xff0000, 0x0000ff, 0x00ff00);
es_es: @colores{'rojo','azul','verde'} = (0xff0000, 0x0000ff, 0x00ff00);

source: As part of the C<ExtUtils::MakeMaker> upgrade, the C<ExtUtils::MakeMaker::bytes> and C<ExtUtils::MakeMaker::vmsish> modules have been removed from this distribution.
es_es: Como parte de la actualización de C<ExtUtils::MakeMaker>, los módulos C<ExtUtils::MakeMaker::bytes> y C<ExtUtils::MakeMaker::vmsish> han sido eliminados de esta distribución.

source: (LIST)
es_es: (LISTA)

source: while ($paragraph =~ /\p{Ll}['")]*[.!?]+['")]*\s/g) {
es_es: while ($parrafo =~ /\p{Ll}['")]*[.!?]+['")]*\s/g) {

source: B<WARNING>: This extended regular expression feature is considered experimental, and may be changed without notice.
es_es: B<AVISO>: Esta característica de expresión regular extendida está considerada experimental, y puede ser modificada sin previo aviso.

source: Alternately, include a C<use v5.10> or later to the current scope.
es_es: O de otra forma, incluya un C<use v5.10> o posterior en el ámbito actual.

source: Closes a directory opened by C<opendir> and returns the success of that system call.
es_es: Cierra un directorio abierto por C<opendir> y devuelve el éxito de la llamada del sistema.

source: It's better to have numerous simple routines than a few monolithic ones.
es_es: Es mejor tener muchas rutinas sencillas que unas pocas monolíticas.

source: It is false as long as its left operand is false.
es_es: Es falso, siempre y cuando su operando izquierdo sea falso.

source: BUGS/CAVEATS/etc
es_es: ERRORES/ADVERTENCIAS/etc

source: For more detail on each item in this checklist, see below.
es_es: Para más detalles sobre cada elemento de esta lista, vea más adelante.

source: =head1 COMMON PITFALLS
es_es: =head1 ERRORES COMUNES
